Tekla Open API Reference for Tekla Structures 2025
Position.Plane Property
 Indicates the positioning in the plane sense.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Position.PlaneEnum Plane { get; set; }
Public Property Plane As Position.PlaneEnum
	Get
	Set
Property Value
Type: Position.PlaneEnum
See Also
Reference
Position Class
Tekla.Structures.Model Namespace